<a href="https://colab.research.google.com/github/saloni1901/Pandas-Numpy-Matplot-Seaborn-basic/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>



#  Pandas from basic to advance

In [9]:
import pandas as pd
data=pd.read_csv('nyc_weather.csv',parse_dates=['EST'])#parse convert str to timestap
data.head(10)

         EST  Temperature  DewPoint  ...  CloudCover  Events  WindDirDegrees
0 2016-01-01           38        23  ...           5     NaN             281
1 2016-01-02           36        18  ...           3     NaN             275
2 2016-01-03           40        21  ...           1     NaN             277
3 2016-01-04           25         9  ...           3     NaN             345
4 2016-01-05           20        -3  ...           0     NaN             333
5 2016-01-06           33         4  ...           0     NaN             259
6 2016-01-07           39        11  ...           3     NaN             293
7 2016-01-08           39        29  ...           8     NaN              79
8 2016-01-09           44        38  ...           8    Rain              76
9 2016-01-10           50        46  ...           7    Rain             109

[10 rows x 11 columns]

In [ ]:
data.Temperature.max()

50

In [ ]:
data.Temperature.min()

20

In [ ]:
data.Temperature.mean()

34.67741935483871

In [ ]:
data['EST'][data['Events']=='Rain']

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [ ]:
data.WindSpeedMPH.mean()

6.225806451612903

In [ ]:
data.fillna(0,inplace=True)#where it find NAN value it replace it with 0
data.head()

        EST  Temperature  DewPoint  ...  CloudCover  Events  WindDirDegrees
0  1/1/2016           38        23  ...           5       0             281
1  1/2/2016           36        18  ...           3       0             275
2  1/3/2016           40        21  ...           1       0             277
3  1/4/2016           25         9  ...           3       0             345
4  1/5/2016           20        -3  ...           0       0             333

[5 rows x 11 columns]

In [ ]:
weather_data={'day':['01-01-2017','02-02-2018','03-04-2019','01-03-2020','07-01-2020','20-01-2021'],
              'temperature':[32,35,28,24,32,31],
              'windspeed':[6,7,2,7,4,2],
              'event':['Rain','Sunny','Snow','Snow','Rain','Sunny']}
df=pd.DataFrame(weather_data)
df.head()

          day  temperature  windspeed  event
0  01-01-2017           32          6   Rain
1  02-02-2018           35          7  Sunny
2  03-04-2019           28          2   Snow
3  01-03-2020           24          7   Snow
4  07-01-2020           32          4   Rain

In [ ]:
r,c=df.shape
print(r,c)

6 4

In [ ]:
df[2:3]

          day  temperature  windspeed event
2  03-04-2019           28          2  Snow

In [ ]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [ ]:
df.day

0    01-01-2017
1    02-02-2018
2    03-04-2019
3    01-03-2020
4    07-01-2020
5    20-01-2021
Name: day, dtype: object

In [ ]:
type(df.day)

pandas.core.series.Series

In [ ]:
df[['event','day']]

   event         day
0   Rain  01-01-2017
1  Sunny  02-02-2018
2   Snow  03-04-2019
3   Snow  01-03-2020
4   Rain  07-01-2020
5  Sunny  20-01-2021

In [ ]:
df.windspeed.min()

2

In [ ]:
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [ ]:
df[df.windspeed>=2]

       temperature  windspeed
event
Rain            32          6
Sunny           35          7
Snow            28          2
Snow            24          7
Rain            32          4
Sunny           31          2

In [ ]:
#df[['day','event']][df.windspeed==df.windspeed.max()]

In [ ]:
df.set_index('day',inplace=True)
#advantage of this to now you can use iloc on day

In [ ]:
df

            temperature  windspeed  event
day
01-01-2017           32          6   Rain
02-02-2018           35          7  Sunny
03-04-2019           28          2   Snow
01-03-2020           24          7   Snow
07-01-2020           32          4   Rain
20-01-2021           31          2  Sunny

In [ ]:
df.loc['03-04-2019']

temperature      28
windspeed         2
event          Snow
Name: 03-04-2019, dtype: object

In [ ]:
df.reset_index(inplace=True)
df

          day  temperature  windspeed  event
0  01-01-2017           32          6   Rain
1  02-02-2018           35          7  Sunny
2  03-04-2019           28          2   Snow
3  01-03-2020           24          7   Snow
4  07-01-2020           32          4   Rain
5  20-01-2021           31          2  Sunny

#different ways of creating dataframe
# 1.using csv
# 2.using excel
# 3.from python dic
# 4.from list of tuple
# 5.from list of dic

In [ ]:
# pd.read_csv('saloni.csv')
# pd.read_excel('saloni.xlsx',"sheet1")
# pd.Dataframe(dicfile)
dff=[('saloni',34,'yes'),('anhoni',45,'no')]
t=pd.DataFrame(dff,columns=['name','age','dec'])
t

     name  age  dec
0  saloni   34  yes
1  anhoni   45   no

In [ ]:
p=[{'day':'mon','event':'rain'},
   {'day':'sun','event':'rain'},
   {'day':'tue','event':'pink'}]
u=pd.DataFrame(p)
u

   day event
0  mon  rain
1  sun  rain
2  tue  pink

In [6]:
type(data.EST[0])

pandas._libs.tslibs.timestamps.Timestamp

In [7]:
data.set_index('EST',inplace=True)

In [8]:
data.head()

            Temperature  DewPoint  Humidity  ...  CloudCover  Events  WindDirDegrees
EST                                          ...
2016-01-01           38        23        52  ...           5     NaN             281
2016-01-02           36        18        46  ...           3     NaN             275
2016-01-03           40        21        47  ...           1     NaN             277
2016-01-04           25         9        44  ...           3     NaN             345
2016-01-05           20        -3        41  ...           0     NaN             333

[5 rows x 10 columns]

In [10]:
p1=pd.DataFrame({'temp':[30,20,40],
                 'wind':[1,2,34]})
p1

   temp  wind
0    30     1
1    20     2
2    40    34

In [11]:
p2=pd.DataFrame({'temp':[90,80,70],
                 'wind':[11,22,44]})
p2

   temp  wind
0    90    11
1    80    22
2    70    44

In [14]:
pd.concat([p1,p2])

   temp  wind
0    30     1
1    20     2
2    40    34
0    90    11
1    80    22
2    70    44

In [16]:
#for ignore index
y=pd.concat([p1,p2],ignore_index=True)

In [19]:
#you want to concat them as columns
t=pd.Series(['humid','sunny','hot','hot','hot','hot'],name='event')
pd.concat([y,t],axis=1)

   temp  wind  event
0    30     1  humid
1    20     2  sunny
2    40    34    hot
3    90    11    hot
4    80    22    hot
5    70    44    hot